% 化简下列二次型，并判断正定性
% 1. 求二次型对应的矩阵A
A = [1,3/2,0;3/2,-1,1;0,1,1]
% 2. 求向量y
syms y1 y2 y3
y=[y1;y2;y3];
% 3. A的标准正交化
[P,D]=eig(A)
x=P*y;
% 4. 求二次型的标准形
f=[y1 y2 y3]*D*y
% f = -1/2*y1^2*17^(1/2)+y2^2+1/2*y3^2*17^(1/2)
% 5. 判断二次型的正定性
D=eig(A)
if all(D>0)
    fprintf('D>0\n')
else
    fprintf('D<=0\n')
end
% D>0时正定，否则非正定，该二次型非正定

% 2. 解法同上
A=[1,0,2;0,-1,-2;2,-2,0]
syms y1 y2 y3
y=[y1;y2;y3];
[P,D]=eig(A)
x=P*y;
f=[y1 y2 y3]*D*y
D=eig(A)
if all(D>0)
    fprintf('D>0\n')
else
    fprintf('D<=0\n')
end
% 结论
% 1.此二次型的标准形：f = -3*y1^2+3/9007199254740992*y2^2+3*y3^2
% 2.正定性：非正定